<div class="row">
    <div class="col-xs-12 page-empl__content">
        <div class="img-01 page-empl__img">
            <?php if( Share::$UserProfile->type != 2 ): ?>
                <div class="btn-wrapp btn-orange-fix-wr"><a href="<?= Share::$UserProfile->type == 3 ? MainConfig::$PAGE_VACPUB : MainConfig::$PAGE_REGISTER ?>" class="hvr-sweep-to-right">опубликовать<br/>вакансию</a></div>
            <?php endif; ?>
        </div>
        <p class="text-justify">Мы гарантируем рекламным, кадровым агентствам и прямым работодателям быстрый поиск персонала, а также минимизация риска при поиске. Чтобы найти подходящего работника, достаточно
            создать вакансию и указать нужные требования, для этого есть огромное количество подсказок.</p>
        <p class="text-justify">Наш сайт не охватывает весь HR рынок, но разместив вакансию - Вы сможете найти
            такой персонал: промоутер, тайный покупатель, мерчендайзер, супервайзер, хостесс, курьер,
            интервьюер, аниматор, кассир, ростовая кукла, модель, консультант, роллер, скейтер и многих других
            узких специальностей.</p>
        <p class="text-justify">Если вашей организации требуется тайный покупатель, то укажите, что этот
            человек должен быть ответственным, коммуникабельным, умеющим работать по четким инструкциям. Сегодня
            очень много людей стремятся найти дополнительный заработок или к примеру: заработать тайным
            покупателем, поскольку эта деятельность предусматривает возможность самостоятельно планировать
            рабочий график, но с учетом указанных временных параметров, а аутстаффинг Prommu создает площадку
            где Вам нужно просто разместить подобную вакансию - и персонал готов к выполнению поставленных
            задач.</p>
        <p class="text-justify">Пользуясь услугами сервиса Prommu, работодатель может нанять промоутера в
            кратчайшие сроки для промо-мероприятия. И исходя из поставленных задач можно выбрать супервайзера,
            который будет контролировать работу выбранных специалистов для достижения максимального
            результата.</p>
        <p class="text-justify">Хотите нанять сотрудника с гарантией эффективного результата? В сервисе Prommu
            есть ряд дополнительных услуг, которые помогут разобраться в любой сложившейся ситуации.</p>
    </div>
</div>

