<div class="row">
    <div class="col-xs-12">
            <p class="text-justify">Все кто когда либо работал или стыкался с организацией временных рекламных кампаний, промо-акций, BTL и других мероприятий стыкался с трудностями различного характера. Сюда можно отнести многое начиная от использования <b>инструментов поиска персонала</b> и заканчивая выбором тактики проведения самого мероприятия. А что делать если предприятие не владеет большим или средним бюджетом для привлечения рекламной компании (посредником) в организации подобных активностей и стимуляции спроса на нужный продукт или услугу? И как провести промо-активность с максимальной отдачей?</p>
          <p class="text-justify">Для решения всех вышеперечисленных вопросов открыт проект Prommu.com - который уникален в своей области. Главной задачей Prommu является собрать у себя на площадке несколько категорий людей узкой специальности. Где работодатели смогут находить нужный им персонал без каких либо посредников, а Соискатели находить работу, планировать свой рабочий день в одном месте.</p>
          <p class="text-justify">В базе развития сайта положен <b>Кадровый аутстаффинг</b>, который осуществляется с участием профессионалов в данной сфере, чему способствует проверка анкеты на подлинность, ее глубина наполнения (учтены все мельчайшие подробности, которые важны в данной сфере). Мы не принимаем к сведению фиктивные заявки от соискателей и работодателей. А подлинные рейтинги и отзывы дополнительно помогут при принятия правильного решения.</p>
    </div>
</div>
<div class="row">
    <div class="col-xs-12">
        <div class="header"><h2><span><a href="#">Работодателям</a></span></h2></div>
    </div>
</div>
<div class="row">
    <div class="col-xs-12 col-sm-6">
        <p class="text-justify">Мы гарантируем рекламным, кадровым агентствам и прямым работодателям <b>быстрый поиск персонала</b>, а также минимизация риска при поиске. Чтобы найти подходящего работника, достаточно
            создать вакансию и указать нужные требования, для этого есть огромное количество подсказок.</p>
        <p class="text-justify">Наш сайт не охватывает весь HR рынок, но разместив вакансию - Вы сможете найти
            такой персонал: промоутер, тайный покупатель, мерчендайзер, супервайзер, хостесс, курьер,
            интервьюер, аниматор, кассир, ростовая кукла, модель, консультант, роллер, скейтер и многих других
            узких специальностей.</p>
        <p class="text-justify">Если вашей организации <b>требуется тайный покупатель</b>, то укажите, что этот
            человек должен быть ответственным, коммуникабельным, умеющим работать по четким инструкциям. Сегодня
            очень много людей стремятся найти дополнительный заработок или к примеру: <b>заработать тайным
            покупателем</b>, поскольку эта деятельность предусматривает возможность самостоятельно планировать
            рабочий график, но с учетом указанных временных параметров, а <b>аутстаффинг</b> Prommu создает площадку
            где Вам нужно просто разместить подобную вакансию - и персонал готов к выполнению поставленных
            задач.</p>
        <p class="text-justify">Пользуясь услугами сервиса Prommu, работодатель может <b>нанять промоутера</b> в
            кратчайшие сроки для промо-мероприятия. И исходя из поставленных задач можно выбрать <b>супервайзера</b>,
            который будет контролировать работу выбранных специалистов для достижения максимального
            результата.</p>
        <p class="text-justify">Хотите нанять сотрудника с гарантией эффективного результата? В сервисе Prommu
            есть ряд дополнительных услуг, которые помогут разобраться в любой сложившейся ситуации.</p>
    </div>
    <div class="col-xs-12 col-sm-6">
        <div class="img-01">
            <?php if( Share::$UserProfile->type != 2 ): ?>
                <div class="btn-wrapp btn-orange-fix-wr"><a href="<?= Share::$UserProfile->type == 3 ? MainConfig::$PAGE_VACPUB : MainConfig::$PAGE_REGISTER ?>" class="hvr-sweep-to-right">опубликовать<br/>вакансию</a></div>
<!--                    <div class="btn-wrapp"><a href="?p=publ-vacancy" class="btn-big-swipe hvr-sweep-to-right">опубликовать<br/>вакансию</a></div>-->
            <?php endif; ?>
        </div>
    </div>
</div>
<div class="row">
    <div class="col-xs-12">
        <div class="header"><h2><span><a href="#">Соискателям</a></span></h2></div>
    </div>
</div>
<div class="row">
    <div class="col-xs-12 col-sm-6">
        <div class="img-02">
            <?php if( Share::$UserProfile->type != 3 ): ?>
                <div class="btn-wrapp"><a href="<?= MainConfig::$PAGE_SEARCH_VAC ?>" class="btn-big-swipe hvr-sweep-to-right">найти<br/>вакансию</a></div>
            <?php endif; ?>
        </div>
    </div>
    <div class="col-xs-12 col-sm-6">
        <p style="text-align: justify;">Вы нуждаетесь в источнике дополнительного или постоянного дохода? Вы студент? Работаете в свободном графике? Не удовлетворены своим нынешним финансовым положением? Тогда сервис Prommu.com именно то что Вам нужно.</p>

        <p style="text-align: justify;">Prommu.com поможет вам быстро, удобно и надежно найти нужную временную работу на промо-, событийных мероприятиях, выставках и рекламных акциях. На нашем сервисе зарегистрированы рекламные, кадровые, модельные агентства, прямые работодатели и все кто ищет временный персонал.</p>
        
        <p style="text-align: justify;">Какие вакансии часто востребованы у наших работодателей? Зайдя на наш сайт Вы сможете найти вакансии:</p>

        <ul>
            <li style="text-align: justify;">промоутера на различных рекламных BTL мероприятих;</li>
            <li style="text-align: justify;">супервайзера;</li>
            <li style="text-align: justify;">мерчендайзера;</li>
            <li style="text-align: justify;">тайного покупателя;</li>
            <li style="text-align: justify;">хостесс;</li>
            <li style="text-align: justify;">курьера;</li>
            <li style="text-align: justify;">интервьера;</li>
            <li style="text-align: justify;">аниматора;</li>
            <li style="text-align: justify;">модели;</li>
            <li style="text-align: justify;">ростовой куклы;</li>
            <li style="text-align: justify;">консультанта;</li>
            <li style="text-align: justify;">а также кассира, грузчика, официанта, бармена и других специальностей.</li>
        </ul>

        <p style="text-align: justify;">Как найти работу на Prommu.com?</p>

        <p style="text-align: justify;">Для того что бы искать работу и получать предложения от работодателей необходимо зарегистрироваться и заполнить основные данные анкеты. Рекомендация от администрации: чем лучше и качественней Вы заполните анкету, тем больше вероятности, того что будете часто получать приглашение по работе.</p>

        <p style="text-align: justify;">Искать работу можно:</p>

        <ul>
            <li style="text-align: justify;">используя поиск вакансий. Все что необходимо это зайти в действующие вакансии, по фильтру отобрать те которые максимально Вам подходят и подавать заявку на желание работать в проекте;</li>
            <li style="text-align: justify;">зарегистрировавшись - работа сама Вас ищет. Сотни работодателей размещая вакансии используют услуги по приглашению персонала на работу. Если Вы соответствуете указанным требованиям - то получите оповещение в личный кабинет, сообщение в социальных сетях, сможете увидеть объявление в ленте (если состоите в профильной группе), а также возможно получите СМС.</li>
        </ul>

        <p style="text-align: justify;">Зачем создавать анкету в Prommu.com?</p>

        <p style="text-align: justify;">В первую очередь, что бы пользоваться всеми преимуществами сайта. Искать работу как пасивно (предложения сами поступают Вам) так и активно (предлагаете свою кандидатуру для работы). Возможность формирования и просмотра рейтинга работодателей.</p>

        <p style="text-align: justify;">Также все желающие могут обезопасить свою работу с нечестными работодателями - выбрав услугу получения банковской карты &quot;ПРОММУ-КОМ&quot;. И последнее, наличие одной анкеты со всеми данными избавляет вас от систематического заполнения анкет с практически одинаковыми данными в различных агентствах и использовать нас как за основу.</p>

    </div>
</div>
