<div class="row">
    <div class="col-xs-12 page-prom__content">
        <div class="img-02 page-prom__img">
            <?php if( Share::$UserProfile->type != 3 ): ?>
                <div class="btn-wrapp"><a href="https://prommu.com/user/register?p=1" class="btn-big-swipe hvr-sweep-to-right">найти<br/>вакансию</a></div>
            <?php endif; ?>
        </div>
        <p style="text-align: justify;">Вы нуждаетесь в источнике дополнительного или постоянного дохода? Вы студент? Работаете в свободном графике? Не удовлетворены своим нынешним финансовым положением? Тогда сервис Prommu.com именно то что Вам нужно.</p>
        <p style="text-align: justify;">Prommu.com поможет вам быстро, удобно и надежно найти нужную временную работу на промо-, событийных мероприятиях, выставках и рекламных акциях. На нашем сервисе зарегистрированы рекламные, кадровые, модельные агентства, прямые работодатели и все кто ищет временный персонал.</p>       
        <p style="text-align: justify;">Какие вакансии часто востребованы у наших работодателей? Зайдя на наш сайт Вы сможете найти вакансии:</p>
        <ul class="page-prom__list">
            <li style="text-align: justify;">промоутера на различных рекламных BTL мероприятих;</li>
            <li style="text-align: justify;">супервайзера;</li>
            <li style="text-align: justify;">мерчендайзера;</li>
            <li style="text-align: justify;">тайного покупателя;</li>
            <li style="text-align: justify;">хостесс;</li>
            <li style="text-align: justify;">курьера;</li>
            <li style="text-align: justify;">интервьера;</li>
            <li style="text-align: justify;">аниматора;</li>
            <li style="text-align: justify;">модели;</li>
            <li style="text-align: justify;">ростовой куклы;</li>
            <li style="text-align: justify;">консультанта;</li>
            <li style="text-align: justify;">а также кассира, грузчика, официанта, бармена и других специальностей.</li>
        </ul>
        <p style="text-align: justify;">Как найти работу на Prommu.com?</p>
        <p style="text-align: justify;">Для того что бы искать работу и получать предложения от работодателей необходимо зарегистрироваться и заполнить основные данные анкеты. Рекомендация от администрации: чем лучше и качественней Вы заполните анкету, тем больше вероятности, того что будете часто получать приглашение по работе.</p>
        <p style="text-align: justify;">Искать работу можно:</p>
        <ul class="page-prom__list">
            <li style="text-align: justify;">используя поиск вакансий. Все что необходимо это зайти в действующие вакансии, по фильтру отобрать те которые максимально Вам подходят и подавать заявку на желание работать в проекте;</li>
            <li style="text-align: justify;">зарегистрировавшись - работа сама Вас ищет. Сотни работодателей размещая вакансии используют услуги по приглашению персонала на работу. Если Вы соответствуете указанным требованиям - то получите оповещение в личный кабинет, сообщение в социальных сетях, сможете увидеть объявление в ленте (если состоите в профильной группе), а также возможно получите СМС.</li>
        </ul>
        <p style="text-align: justify;">Зачем создавать анкету в Prommu.com?</p>
        <p style="text-align: justify;">В первую очередь, что бы пользоваться всеми преимуществами сайта. Искать работу как пасивно (предложения сами поступают Вам) так и активно (предлагаете свою кандидатуру для работы). Возможность формирования и просмотра рейтинга работодателей.</p>
        <p style="text-align: justify;">Также все желающие могут обезопасить свою работу с нечестными работодателями - выбрав услугу получения банковской карты &quot;ПРОММУ-КОМ&quot;. И последнее, наличие одной анкеты со всеми данными избавляет вас от систематического заполнения анкет с практически одинаковыми данными в различных агентствах и использовать нас как за основу.</p>
    </div>
</div>